// Нэмэлт одтой бодлогууд 
 
// const n = 5;
// 1)
// * * * * *
// * * * * *
// * * * * *
// * * * * *
// * * * * *

// 2)
// *
// * * 
// * * * 
// * * * * 
// * * * * * 

// 3)
//     *
//    * * 
//   * * * 
//  * * * * 
// * * * * * 

// 4)
//     *
//    * * 
//   *   * 
//  *     * 
// * * * * * 

// 5)
//     *
//    * * 
//   *   * 
//  *     * 
// *       * 
//  *     * 
//   *   * 
//    * * 
//     *
 

//  Bodlogo 1

// let a=5 , i=0 , star= ""
// for( b=0 ; b<a ; b++){
//     for( i=0 ; i<a ; i++){
//         star=star + "* "
//     }
//     star=star + "\n"
// }
// console.log(star)

// Bodlogo 2
let star="" , a=5
for(i=0 ; i>a ; i++){
    star=star + "* "
} console.log(star)